package ch6;

/* 객체지향언어 - 자바
 * 코드의 재사용성이 높다, 코드 관리가 용이, 신뢰성 높은 프로그래밍을 가능하게 함
 * 클래스: 객체를 정의해 놓은 것
 * 클래스 용도: 객체를 생성하는 데 사용
 * 객체: 실제로 존재하는 것, 사물or개념
 * 
 * 
 * 메인이 없으면 실행이 안됨
 *
 * 
 * 
 * 클래스 구성요소
 * 1. 멤버변수 - 속성
 * 2. 메소드 - 기능
 * 3. 생성자 - 인스턴스 초기화 담당
 * 	1) 매개변수가 없는 생성자(기본생성자)
 * 	2) 매개변수가 있는 생성자
 * 
 * 
 * 
 * 메소드 작성
 * 특정 작업을 수행하는 일련의 문장들을 하나로 묶어 놓은 거
 * 수학 함수와 유사
 * 리턴(반환)타입 메소드명(){}
 * 리턴(반환)타입 메소드명(타입변수명,....){}
 * void, 앞에서 사용했던 변수 타입 다 가능, 배열 가능
*/
public class Tv {
	
	//속성(property) ==> 멤버변수
	//크기, 길이, 높이, 색상, 볼륨, 채널... 
	String color; //색상
	int channel; //채널
	boolean power; //전원상태 
	
	//기능(function) ==> 메서드
	//켜기, 끄기, 볼륨 높이기, 볼륨 낮추기, 채널 변경...
	// void : 메소드 실행이 끝난 후 리턴값 없음 
	void power() {
		power = !power;
	}
	
	//채널을 증가하고 현재 채널을 리턴
	// int : 메소드가 실행이 끝난 후 int 값을 가지고 돌아감
	int channelUp() {
		channel++;
		return channel;
	}
	
	void channelDown() {
		channel--;
	}

}
